Разработайте класс FloatSum, который при запуске из командной строки будет складывать переданные в качестве аргументов целые числа и выводить их сумму на консоль.
Примеры запуска программы:

  java Sum 1.0 2.0 3.0
    Результат: 6.0

  java Sum " "
    Результат: 0.0
  
Аргументы могут содержать:
цифры;
знаки + и -;

произвольные пробельные символы.
При выполнении задания можно считать, что для представления входных данных и промежуточных результатов достаточен тип int.
Для отладочного вывода используйте System.err, тогда он будет игнорироваться проверяющей программой.

Входные данные являются 32-битными числами с формате с плавающей точкой
